tutorials/Yjunction/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }

    inlet1
    {
        type            fixedValue;
        value           uniform (-1 -1 0);

    }

    inlet2
    {
        type            fixedValue;
        value           uniform (-1 1 0);
    }

    walls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
