tutorials/Yjunction/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(-0.416974 -0.192074 0)
(-0.534499 -0.263939 -2.14077e-23)
(-0.410603 -0.334105 1.2761e-20)
(-0.439099 -0.200672 0)
(-0.382323 -0.298397 -1.30623e-20)
(-0.496798 -0.294575 0)
(-0.453314 -0.187812 1.57444e-21)
(-0.523582 -0.303208 3.19536e-21)
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet1
    {
        type            fixedValue;
        value           uniform (-1 -1 0);
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
