tutorials/Yjunction/0/Ulift1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(-0.502568 0.331811 0)
(-0.482043 0.195085 5.25072e-21)
(-0.370307 0.276896 -2.84641e-21)
(-0.504847 0.28119 0)
(-0.391144 0.290272 -4.92486e-21)
(-0.441816 0.190353 0)
(-0.523944 0.298467 1.70478e-21)
(-0.445359 0.189211 3.17739e-21)
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (-1 1 0);
    }
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
